# Вводится число, например: 1231.
# Вывести строчку, например: один два три один.
# Подсказка: создайте словарь

const_dict = {"1": "Один", "2": "Два", "3": "Три", "4": "Четыре", "5": "Пять", "6": "Шесть",
              "7": "Семь", "8": "Восемь", "9": "Девять", "0": "Ноль"}

value = input("Введите число: ")

result_string = ""
for i in range(len(value)):
    result_string += const_dict[value[i]] + " "

print(result_string)
