##Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
# Примечание: сторону квадрата получаем через функцию input().
x = 10
a = int(input("Print a: "))
b = int(input("Print b: "))
print('a = ' + str(a) + ' b = ' + str(b))
print('a + b = ' + str(a+b))
print('a - b = ' + str(a-b))
print('a / b = ' + str(a/b))
print('a * b = ' + str(a*b))
print('a // b = ' + str(a//b))
print('a % b = ' + str(a % b))
print('a ** b = ' + str(a**b))
